// 이프.cpp : 이 파일에는 'main' 함수가 포함됩니다. 거기서 프로그램 실행이 시작되고 종료됩니다.
//

#include <iostream>

int main()
{
    //게임은 if로 만든다는 말이 있다.
    //이제부터 진짜 코딩
    //if 탭을 누르면 자동완성 if (논리형) 참과거짓
    //인자 안의 값이 참이라면 실행, 거짓이면 실행하지 않음 
    //else = 위 if 관련코드가 모두 거짓이라면 실행
    //else if , 간단하게 이건어때? 라고 하는것.
    //위의 if 코드가 거짓이면 인자값을 확인하여 참이면 실행, 거짓이면 실행하지 않음
    //if 코드는 하나의 세트로 보며, 하나의 값이 참으로 확인되어 실행 될 경우 나머지는
    //모두 무시된다. 
    

    //if ( 메모리 영역 )
    int Att = 100;

    if (100 != Att)
    {
        int a = 0;
    }

    else if (true) // 이건어때?
    {
        int a = 0;
    }

    else //위에 if 코드 다아니면 이거 실행해
    {
        int a = 0;
    }


}

