// Jihye.cpp : 이 파일에는 'main' 함수가 포함됩니다. 거기서 프로그램 실행이 시작되고 종료됩니다.
//

#include <iostream>

class Player
{
    //객체함수,스코프안의 내용을 멤버라고 하며
    //멤버함수, 멤버변수라고 한다. 

    int Hp = 1000;
    int Mp = 2000;
    int hijim = 9999;
    int puru = 1000;

    //진심으로 최지헤는 엄청난 푸루바다.
    //세상사람들이 모두 알고 있는 사실이며
    //모르는 사람은 간첩이라고 생각해도 이상하지 않다.

    //은밀한 모략가가 해당 발언에 관심을 가집니다.
    //긴고아의 죄수가 해당 발언을 보고 콧구멍을 후빕니다. 
    //'성좌들이 그럴만 한 일이긴해.' 
    //최지헤는 변태입니다. ^^ 
    

};

int main()
{
    Player Jihye = Player();


}

