// class.cpp : 이 파일에는 'main' 함수가 포함됩니다. 거기서 프로그램 실행이 시작되고 종료됩니다.
//


//클래스
#include <iostream>

//객체지향의 기본 (선클래스 후보고)
//클래스, 캐릭터나 배경 + @ ~을 만들라고 하면, 
//클래스 함수를 이용하여 만들부분을 선언을 해야한다. 
//무엇을 만들고 싶은지 일단 정해야 한다. 
//객체지향에서 전역이라는 것은 존재할 수 없다. 

//C++ 은 멀티 패러다임 언어이며
//객체지향과 절차지향을 둘 다 할 수 있다.

//객체지향 언어는 오로지 객체로만 만들어야하며, 객체 이외의 것은 존재할 수 없다. 
//절차지향의 장점 - 빠르다. 단점 - 생산성이 낮다.
//객체지향의 단점은 느리지만, c++은 객체지향 언어 중 가장 빠르며 생산성이 높다. 
//잘못 만들게 되면, 절차지향의 단점과 객체지향의 단점만 사용하게 될 수 도 있다.

//클래스 
//class 이름
//{  < 클래스의 시작
//};  < 클래스의 끝 

//순수한 객체지향이라면 전역은 존재할수 없음 => 객체 지향
//오로지 객체만으로 코딩한다는 뜻이다. 
//class 는 그런 객체의 설계도이며 객체를 만들려면 클래스가 우선 만들어져야 하며
//클래스 안에 존재하지 않는 것은 허용하지 않아야 하는데 c++은 허용된다. 


class Player
{

};

class Monster
{

};


int main()
{
    
    
}

